{
  "projects": [
    {
      "name": "Webify",
      "link_id": "online_portfolio",
      "date": "May 2020 ",
      "short": "A small step to webify the journey of work and life",
      "status": "complete",
      "description":"A digitize version of my experience and journey.The back end  is powered by python Flask framework.A lot of Jinja2 templating is used for the data formatting and representation to the rendered html files.The html/css ,front end pages were not builed from scratch.Just modified as per the templating engine of jinja2(the template with all the necessary html/css and js were downloaded)and the back end is build from scratch.Supporting modules such as os,json were used and rendering is done on Flask.Feel free to visit the Github link to download the project",
      "weight": 4327,
	  "github":"https://github.com/hazra1991/portfolio",
      "photos": [
        "/static/projects/portfolio/homepage.jpg"
      ]
    },
    {
      "name": "SCP/SNMP Miro-service",
      "link_id": "SNMP/SCP_collector",
      "date": "Dec 2019 ",
      "short": "A small micro service that filters/verifies duplicates in csv snmp data received from main collector program and scp it to a list of servers while backing-up the old data",
      "github":"https://github.com/hazra1991/portfolio",
      "description":"A small micro service that filters/verifies duplicates in csv snmp data received from main collector program and scp it to a list of servers while backing-up the old data. Mainly all the functionality including transfer ,file locking, formatting of data is all achieved by pythons in built library and the pandas.Please visit the github link for the source code (NOTE:THIS PROJECT WAS DISCONTINUED HENCE NO FURTHER UPDATE ON TO THE REPOSITORY). No vendor proprietary library were used in code."
    },
    {
      "name": "snmpwalk/ping validator module(using thread)",
      "link_id": "snmpwalkr_ping_validator",
      "date": "April 2020 ",
      "short": "A command-line utility for linux server to check the availability of devices for snmpwalk needed to be given to a Network monitoring tool for discovery",
      "github":"https://github.com/hazra1991/snmpwalk_Automate",
      "description":"A command-line utility for linux server to check the availability of devices for snmpwalk needed to be given to a Network monitoring tool.This utility has been built backward compatible as well for python 2.7*.Threading is widely used in the program and the spun threads count is also controlled form the command line at runtime.The input for the IPs and community string (or strings) are completely modular.Built with the python native libraries only"
    },
    {
      "name": "Reverse-shell (server and client)",
      "link_id": "Reverse-shell",
      "date": "June 2020 ",
      "short": "A Hobby project including a interactive command line terminal server that can accept multiple connections from client and can remotely connect and control the client,User can switch between multiple clients",
      "github":"https://github.com/hazra1991/reverse_shell",
      "description":"An interactive terminal designed to accept client requests and provide a streaming connection to control them. The application is built with the help of tcp sockets and extensive use of threading to control different jobs.A lot of concepts like inheritance and proper use of them has been put to some real use during the building of this project.Event driven alerts are been used as well using he signal module. Here just the socket implementation is done wrapping it with specific scenarios and error handling,No character set or NVT is reinvented or any kind of protocol is implemented. Measures has also been taken for continuous client connection try and closer of any pending or broken connection..",
      "photos": [
        "/static/projects/reverse_shell/reverseshell.png"
  	]
    
    }
  ]
}
